import type { AvitoReview, YandexReview } from "@/types/review";

export const avitoReviews: AvitoReview[] = [
  {
    id: "361581078",
    author: "Mister Green",
    rating: 5,
    comment:
      "Замечательная студия звукозаписи с ребятами,знающими свое ремесло. Я отлично провел время и получил качественную запись.цена не кусается.рекомендую",
    date: "2025-09-10",
  },
  {
    id: "354807718",
    author: "Namenami",
    rating: 5,
    comment: "Всё было отлично, спасибо Евгению 👍",
    date: "2025-08-18",
  },
  {
    id: "350733334",
    author: "kid going be depressed",
    rating: 5,
    comment: "Всё на высоте, быстро оформил - быстро забрал, рекомендую!",
    date: "2025-08-03",
  },
  {
    id: "323034454",
    author: "Имя скрыто",
    rating: 5,
    comment: "Все отлично",
    date: "2025-04-24",
  },
  {
    id: "306068774",
    author: "Константин",
    rating: 5,
    comment: "Толковый молодой человек, получил именно то что хотел.",
    date: "2025-02-27",
  },
  {
    id: "285898822",
    author: "КБ Конструктор",
    rating: 5,
    comment: "Все супер, записали вокал для пары песен, я доволен. Микрофон крутой, ребята отличные, рядом с домом, цена приемлемая! Придем ещё!",
    date: "2024-12-19",
  },
  {
    id: "284045510",
    author: "Иван Заболотный",
    rating: 5,
    comment:
      "Студия очень атмосферная, хорошее оборудование, и самые лучше звукари Краснодара. Мне помогли раскрепоститься у микрофона, очень грамотные парни знающие свое дело 💯🎙️",
    date: "2024-12-13",
  },
  {
    id: "282760246",
    author: "JR RECORDS",
    rating: 5,
    comment: "Потрясающе качественный звук. Однозначно, на студии решает человеческий фактор. Юрий, звукарь, просто боженька. Я в восторге 😁🤗😍😝",
    date: "2024-12-09",
  },
  {
    id: "262052070",
    author: "Михаил",
    rating: 5,
    comment: "лучшая сту в краснодаре, лучший звукарь, самое лучшее времяпровождения, лучшая работа и результат!",
    date: "2024-10-02",
  },
  {
    id: "252316630",
    author: "Никита",
    rating: 5,
    comment: "Отличная студия звукозаписи, с профессиональным звукарём. Записались отлично",
    date: "2024-08-28",
  },
  {
    id: "247487526",
    author: "ARKANY STORE",
    rating: 5,
    comment: "Наконец нашел то чего не мог найти)\nБиг лав ❤️",
    date: "2024-08-11",
  },
  {
    id: "227476278",
    author: "Саша Малышев",
    rating: 5,
    comment: "Ребята на студии очень общительные и профессиональные. Сделали все качественно. Это точно лучшая студия в Краснодаре по моему мнению.",
    date: "2024-05-23",
  },
  {
    id: "226408166",
    author: "Мария Конкина",
    rating: 5,
    comment: "Хорошая работа,  добросовестное общение. Все довольны, отличное исполнение нашего заказа!!! Приятно сотрудничать:)",
    date: "2024-05-18",
  },
  {
    id: "221588790",
    author: "Максим",
    rating: 5,
    comment: "Хорошая студия. Быстро ответили и забронировали место.",
    date: "2024-05-06",
  },
];

export const yandexReviews: YandexReview[] = [
  {
    id: "A16HMYw2EXk60U1IYj5acUItNz84NX_Ir",
    author: "Артем Кругликов",
    rating: 5,
    comment:
      "Записывался в этой студии. Отличный звук, ребята знают толк в тяжелой музыке. Аппаратура мощная, саундчек быстрый, инженеры понимают с полуслова. Получили плотный, живой звук - именно то, что хотел. \nАтмосфера свободная, можно спокойно работать и экспериментировать. \nВернусь сюда еще раз. ",
    date: "2025-09-29",
  },
  {
    id: "h-Hm8dKjQh2ZYVoYVygjtXS19VM22pl",
    author: "Саймон Галик",
    rating: 5,
    comment:
      "Обращался в студию для сведения и мастеринга трека, который записывал дома. Задача была сделать из сырого материала радиоформатный продукт. Результатом более чем доволен! Звукорежиссёр отлично понял мои пожелания, убрал все шероховатости, выстроил баланс и добавил звуку плотности и яркости. Порадовало внимательное отношение к деталям и скорость работы. Очень адекватные цены для такого высокого уровня. Теперь знаю, куда обращаться за финальным звуком.",
    date: "2025-09-26",
  },
  {
    id: "-CxHbSFIis1Y0Q0Iy9M8IZ5keDRDNqr",
    author: "Сергей П.",
    rating: 5,
    comment:
      "Очень толковые ребята. Нужен был трек для коммерческого использования, все объяснили и показали на пальцах. Ребята разбираются и, самое главное, не забивают, делают на результат.",
    date: "2025-09-29",
  },
  {
    id: "tSuT8ocqRf0_QPuTXbBAXMcvIep0y4OLm",
    author: "Анчоус",
    rating: 5,
    comment: "Все идеально. Аппаратура на высшем уровне, если есть вопросы всегда подскажут и помогут. Очень доволен, всем советую!",
    date: "2025-09-29",
  },
  {
    id: "wX01xpL8sZnywNmEaYcBIN7dvxmuUSeom",
    author: "Даниил",
    rating: 5,
    comment: "Серьезная студия, парни профессионалы, понимают с полуслова.\nЕще обязательно вернусь.\n🔥🔥🔥",
    date: "2025-09-23",
  },
  {
    id: "7N9jNzpGRRkt35EmqpnDdyXFUFt1Ay",
    author: "Софья К.",
    rating: 5,
    comment:
      "Отличная студия звукозаписи ! Очень понравилась работа звукорежиссеров , наконец-то кто-то понял и смог сделать что я хочу !\nСпасибо огромное !!!",
    date: "2025-09-22",
  },
];
